#ifndef __EMV_RISK_MANA__
#define __EMV_RISK_MANA__

/******************************************************************************
 *  	函数名称:	Emv_risk_mana: 
 *	函数介绍:	终端风险管理
 *	入口参数:	
 *	出口参数:     
 * 	返回值  :		
 ******************************************************************************/
void Emv_risk_mana(YESORNO bForceOnline,char cTransMode);
/******************************************************************************
 *  	函数名称:	CheckExceptionFile: 
 *	函数介绍:	异常文件检查
 *	入口参数:	
 *	出口参数:     
 * 	返回值  :		
 ******************************************************************************/
int CheckExceptionFile();
#endif